Repository: jolaf/steganography
Catalog: gettext/*.po
Languages: ru

source: en
ru: ru

source: Steganography
ru: Стёганография

source: Vasily Zakharov (vmzakhar@gmail.com
ru: Василий Захаров (vmzakhar@gmail.com

source: Applied visual cryptography for Larp
ru: Прикладная визуальная криптография для РИ

source: Select language
ru: Выберите язык

source: Task name
ru: Имя задачи

source: used to generate output file names
ru: используется для формирования имён генерируемых файлов

source: Max preview size
ru: Максимальный размер просмотра

source: px
ru: пикселов

source: clear the fields to impose no limit
ru: очистите поля для снятия ограничений

source: Resize image to
ru: Масштабировать изображение в

source: times or
ru: раз или до

source: only specify one value to constrain proportions
ru: указывайте только одно из значений, если хотите сохранить пропорции изображения

source: Resize lock to
ru: Масштабировать замок в

source: specify one value only; smaller image would be placed in larger one randomly
ru: указывайте только одно из значений; меньшее изображение будет размещено внутри бо́льшего в случайном месте

source: Random key rotation
ru: Случайный поворот ключа

source: Random key flip
ru: Случайное отзеркаливание

source: Employ dithering
ru: Использовать дизеринг

source: emulates grayscale, but hardens decryption
ru: пытается передать оттенки серого, но усложняет дешифровку

source: Smoother background
ru: Равномерный фон

source: doubles the image resolution
ru: удваивает размеры изображения

source: Reset options to defaults
ru: Сбросить настройки на значения по умолчанию

source: Click to remove this image from processing
ru: Нажмите, чтобы убрать это изображение из обработки

source: Remove
ru: Убрать

source: Click to upload a file to process
ru: Нажмите, чтобы загрузить изображение для обработки

source: Upload
ru: Загрузить

source: Click for full screen preview
ru: Нажмите, чтобы открыть изображение в новой вкладке

source: preview
ru: просмотр

source: Click to download to your device
ru: Нажмите, чтобы скачать изображение на ваше устройство

source: Download
ru: Скачать

source: Vasily Zakharov
ru: Василий Захаров

source: Victor Kurush
ru: Виктор Куруш

source: integer
ru: целое

source: float
ru: десятичное

source: GETTEXT_TEST
ru: GETTEXT_TEST_ru_RU

source: Do not use
ru: Не используйте

source: Source image
ru: Исходный рисунок

source: Lock mask
ru: Маска замка́

source: Key mask
ru: Маска ключа

source: Processed source
ru: Обработанный исходник

source: Processed lock mask
ru: Обработанная МЗ

source: Processed key mask
ru: Обработанная МК

source: Generated lock
ru: Готовый замо́к

source: Generated key
ru: Готовый ключ

source: Overlay test
ru: Тест наложения

source: Processing image
ru: Обработка изображения

source: processing image
ru: обработки изображения

source: ERROR
ru: ОШИБКА

source: bytes
ru: байт

source: loading image
ru: загрузки изображения

source: Loading image
ru: Загрузка изображения
